app/controllers/games_controller.rb

  def index
    @current_game = Game.find_by(id: session[:game_id])
---
SELECT "games".* FROM "games" WHERE "games"."id" IS NULL LIMIT 1

  def destroy
    @game.destroy!
---
DELETE FROM "games" WHERE "games"."id" = 9

  def set_game
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = 2 LIMIT 1