app/controllers/games_controller.rb

  def index
    @current_game = Game.find_by(id: session[:game_id])
---
SELECT "games".* FROM "games" WHERE "games"."id" IS NULL LIMIT ?  [["LIMIT", 1]]